Repository: freifunk-darmstadt/fritz-tools
Catalog: docs/locale/*/LC_MESSAGES/flashing/macos.po
Languages: de

source: Flash Gluon using MacOS X
de: Installation von Gluon mittels MacOS X

source: Your router can be flashed in a few easy step from MacOS X.
de: Dein Router kann in ein paar einfachen Schritten mit MacOS X installiert werden.

source: Preperation
de: Vorbereitung

source: To execute the fritzflash.py script you need to have Python 3 installed. You can obtain the latest version from the Python project here_.
de: Zur Ausführung von fritzflash.py muss Python 3 installiert sein. Du kannst die letzte Version here_ vom Python Projekt beziehen.

source: You also need to download the image for your device from your local Freifunk community. This is important to make right now as you will have no ability to do so later on.
de: Auch du das Image für dein Gerät von deiner lokalen Freifunk-Community herunterladen. Es ist wichtig dies jetzt zu tun, da du später nicht die Möglichkeit hierzu haben wirst.

source: Download the flash-script
de: Lade das Flash-Skript herunter

source: Open a terminal by pressing cmd+Space.
de: Öffne ein Terminal durch drücken von cmd+Leertaste.

source: Next, go to the directory you saved the Image you downloaded in the preperation step. In most cases this is done by èxecuting ``cd Downloads``.
de: Gehe als nächstes in das Verzeichnis in welches du das Image herutnergeladen hast. In den meisten Fällen tust du das durch ausführen von ``cd Downloads``.

source: Now you want to download the script by executing ``curl -O https://raw.githubusercontent.com/freifunk-darmstadt/fritz-tools/master/fritzflash.py``.
de: Nun lädst du das Skript durch ausführen von ``curl -O https://raw.githubusercontent.com/freifunk-darmstadt/fritz-tools/master/fritzflash.py`` herunter.

source: Confirm both the Gluon image you want to flash and the script are present in the current directory by executing ``ls``.
de: Stelle durch ausführen von ``ls`` sicher, dass sich sowohl das Gluon-Image als auch das Skript im aktuellen Verzeichnis befinden.

source: Keep the Terminal window open.
de: Schließe das Terminal-Fenster nicht.

source: Configuring a static IP-address
de: Stelle eine statische IP-Adresse ein

source: Open ``System Preferences`` and select ``Network``.
de: Öffne die ``Systemeinstellungen`` und wähle ``Netzwerk`` aus.

source: Make sure to disable your Wireless connection now.
de: Sollte dein Computer über WiFi verfügen, deaktiviere dieses nun.

source: Select ``Ethernet`` from the left menu and in case input fields are grayed out, unlock settings by clicking on the Lock in the bottom left corner.
de: Wähle im linken Menü ``Ethernet`` aus. Sollten die Eingebefelder ausgegraut sein, entsperre sie durch klick auf das Schloss in der unteren linken Ecke.

source: Configure your settings as seen in following screenshot and confirm by clicking on ``Apply``. Keep the window opened.
de: Fülle die Felder wie auf dem nachfolgenden screenshot ersichtlich aus und bestätige durch Klick auf ``Anwenden``. Schließe das Fenster nicht.

source: Install Gluon
de: Gluon installieren

source: Connect the router with your computer. In case it has multiple ports, use the yellow LAN-ports.
de: Verbinde den Router mit deinem Computer. Sollte dein Router mehrere Ports haben, benutze die gelben LAN-Ports.

source: Execute the flash-script by executing ``python3 fritzflash.py`` in the Terminal window you left open.
de: Führe das Flashskript mittels ``python3 fritzflash.py`` im Terminal-Fenster, welches du offen gelassen hast, aus.

source: In case you're asked to allow incoming connection or not select ``Allow``.
de: Solltest du gefragt werden ob du eingehende Verbindungen zulassen möchtest, bestätige dies durch Klick auf ``Zulassen``.

source: In case you missed the 10 second window after powering on your AVM device power cycle it again.
de: Falls du das 10 Sekunden Zeitfenster nach dem Start verpasst hast starte das AVM Gerät jetzt nocheinmal neu."

source: Revert network settings
de: Wiederherstellen der Netzwerkeinstellungen

source: Before you are able to reach the Config-mode of your new node you have to reconfigure your network interface to automatically obtain an IP-address using DHCP.
de: Bevor du den Konfigurationsmodus deines neuen Freifunk-Knotens erreichen kannst, musst du die Netzwerkeinstellungen wieder zurückstellen, damit du mittels DHCP automatisch eine IP-Adresse bekommst.

source: Configure your ``Ethernet`` interface as pictured on the screenshot below and confirm by selecting ``Apply``.
de: Stelle dein Netzwerk wie im folgenden Screenshot erkennbar ein und bestätige mit Klick auf ``Anwenden``.
