Repository: freifunk-darmstadt/fritz-tools
Catalog: docs/locale/*/LC_MESSAGES/flashing/ubuntu_1804.po
Languages: de

source: Flash Gluon using Ubuntu 18.04
de: Installation von Gluon mittels Ubuntu 18.04

source: Your router can be flashed in a few easy step from Ubuntu 18.04.
de: Dein Router kann in ein paar einfachen Schritten mit Ubuntu 18.04 installiert werden.

source: Preperation
de: Vorbereitung

source: First you need to download the image for your device from your local Freifunk community. This is important to do right now as you will have no ability to do so later on.
de: Zuerst musst du das Image für dein Gerät von deiner lokalen Freifunk-Community herunterladen. Es ist wichtig dies jetzt zu tun, da du später nicht die Möglichkeit hierzu haben wirst.

source: Download the flash-script
de: Lade das Flash-Skript herunter

source: Open a terminal by pressing ``Ctrl+Alt+T`` or open the application-drawer (bottom left) and search for Terminal.
de: Öffne ein Terminal mittels ``Strg+Alt+T``. Alternativ kannst du auch im Application-Drawer (unten links) nach Terminal suchen.

source: Next, go to the directory you saved the image you downloaded in the preperation step. In most cases this is done by executing ``cd Downloads``.
de: Navigiere als nächstes in das Verzeichnis, in welches du das Image heruntergeladen hast. In den meisten Fällen tust du dies durch ausführen von ``cd Downloads``.

source: Now you want to download the script by executing ``wget https://raw.githubusercontent.com/freifunk-darmstadt/fritz-tools/master/fritzflash.py``.
de: Nun lädst du das Skript durch ausführen von ``wget https://raw.githubusercontent.com/freifunk-darmstadt/fritz-tools/master/fritzflash.py`` herunter.

source: Confirm both the Gluon image you want to flash and the script are present in the current directory by executing ``ls``.
de: Stelle durch ausführen von ``ls`` sicher, dass sich sowohl das Gluon-Image als auch das Skript im aktuellen Verzeichnis befinden.

source: Keep the Terminal window open.
de: Schließe das Terminal-Fenster nicht.

source: Configuring a static IP-address
de: Stelle eine statische IP-Adresse ein

source: Open the settings application.
de: Öffne das Programm Einstellungen.

source: If your computer has WiFi, make sure to disable it now.
de: Sollte dein Computer über WiFi verfügen, deaktiviere dieses nun.

source: Select ``Network`` from the left menu and open the settings by clicking on the gear button.
de: Wähle aus dem linken Menü ``Netzwerk`` aus und öffne die Einstellungen durch klicken auf das Zahnrad-symbol.

source: Configure your Settings as seen in the following screenshot and confirm by clicking on ``Apply`` in the top right corner.
de: Fülle die Felder wie auf dem nachfolgenden screenshot ersichtlich aus und bestätige durch Klick auf ``Anwenden`` in der rechten oberen Ecke.

source: Now you will need to deactivate and reactivate the network interface to correctly apply the settings. Do so by turning the connection from On to Off. Wait two seconds and turn the connection back On again.
de: Nun musst du zum übernehmen der Einstellungen das Netzwerk kurz Aus- und wieder Einschalten. Schalte das Netzwerk aus, warte zwei Sekunden und schalte es wieder ein.

source: Keep the settings window open.
de: Schließe das Einstellungs-Fenster nicht.

source: Install Gluon
de: Gluon installieren

source: Connect the router with your computer. In case it has multiple ports, use the yellow LAN-ports.
de: Verbinde den Router mit deinem Computer. Sollte dein Router mehrere Ports haben, benutze die gelben LAN-Ports.

source: Execute the flash-script by executing ``python3 fritzflash.py`` in the Terminal window you left open.
de: Führe das Flashskript mittels ``python3 fritzflash.py`` im Terminal-Fenster, welches du offen gelassen hast, aus.

source: In case you missed the 10 second window after powering on your AVM device power cycle it again.
de: Falls du das 10 Sekunden Zeitfenster nach dem Start verpasst hast starte das AVM Gerät jetzt nocheinmal neu."

source: Revert network settings
de: Wiederherstellen der Netzwerkeinstellungen

source: Before you are able to reach the Config-mode of your new node you have to reconfigure your network interface to automatically obtain an IP-address using DHCP.
de: Bevor du den Konfigurationsmodus deines neuen Freifunk-Knotens erreichen kannst, musst du die Netzwerkeinstellungen wieder zurückstellen, damit du mittels DHCP automatisch eine IP-Adresse bekommst.

source: Configure your network interface interface as pictured on the screenshot below and confirm by selecting ``Apply``.
de: Stelle dein Netzwerk wie im folgenden Screenshot erkennbar ein und bestätige mit Klick auf ``Anwenden``.

source: You will (again) need to deactivate and reactivate the Network interface to correctly apply the settings. Do so by turning the connection from On to Off. Wait two seconds and turn the connection back On again.
de: Du musst (wieder) die Einstellungen durch Aus- und Wiedereinschalten des Netzwerkes übernehmen. Schalte das Netzwerk aus, warte zwei Sekunden und schalte es wieder ein.
