Repository: freifunk-darmstadt/fritz-tools
Catalog: docs/locale/*/LC_MESSAGES/flashing/windows10.po
Languages: de_de

source: Flash Gluon using Windows 10
de_de: Installation von Gluon mittels Windows 10

source: Your router can be flashed in a few easy step from Windows 10.
de_de: Dein Router kann in ein paar einfachen Schritten mit Windows 10 installiert werden.

source: Preperation
de_de: Vorbereitung

source: First you need to download the image for your device from your local Freifunk community. This is important to do right now as you will have no ability to do so later on.
de_de: Lade zuerst das Image für dein Gerät bei deiner lokalen Freifunk-Community herunter. Es ist wichtig dies jetzt zu tun, da du später keine Möglichkeit dafür hast.

source: Download Python 3 for Windows
de_de: Python 3 für Windows herunterladen

source: Download and install the latest version of Python 3. It can be obtained from the website_ of the Python project.
de_de: Lade die aktuellste Version von Python 3 herunter und installiere diese. Die nötige Installationsdatei findest du auf der website_ des Python Projektes.

source: Download the flash-script
de_de: Lade das Flash-Skript herunter

source: Download the latest version of the flash-script ``fritzflash.py`` at the link below. In case you are prompted whether you want to save or open this file, select save.
de_de: Lade die aktuellste Version des Flash-Skripts ``fritzflash.py`` über den Link unten herunter. Falls du gefragt wirst, ob du die Datei Öffnen oder Speichern möchtest, wähle Speichern aus.

source: Disable WiFi
de_de: WLAN deaktivieren

source: In case your computer is connected via WiFi, make sure to disable this connection by opening the Quick-settings in the lower right corner. Make sure WiFi is disabled there.
de_de: Falls dein Computer über eine WLAN-Verbindung verfügt, stelle sicher diese zu deaktivieren. Öffne dafür die Schnelleinstellungen in der unteren rechten Ecke. Stelle sicher dass WLAN dort deaktiviert ist.

source: Configuring a static IP-address
de_de: Stelle eine statische IP-Adresse ein

source: Open the network settings by opening Quick-settings and navigate to the ``Network and Sharing Center.``
de_de: Öffne die Netzwerkeinstellungen indem du in den Schnelleinstellungen in das ``Netzwerk und Freigabecenter`` navigierst.

source: Go to the ``Network Adapter Settings``.
de_de: Gehe in die ``Adapteroptionen``.

source: Select the adapter called ``Ethernet``.
de_de: Wähle den Adapter mit dem Namen ``Ethernet`` aus.

source: In the adapter-status window, select properties.
de_de: Wähle im Adapter-Status Fenster ``Eigenschaften`` aus

source: Double-click on ``Internet Protocol Version 4``.
de_de: Doppelklick auf ``Internetprotokoll, Version 4 (TCP/IPv4)``.

source: Fill out all fields as seen on the image below. Close afterwards both windows by clicking ``OK``.
de_de: Fülle alle Felder wie auf dem unteren Bild erkennbar. Schließe anschließend beide Fenster mit einem klick auf ``OK``.

source: Install Gluon
de_de: Gluon installieren

source: Now move both fritzflash.py and the Gluon image in an empty directory.
de_de: Verschiebe nun sowohl das Flash-Skript fritzflash.py als auch das Gluon-Image in einen leeren Ordner.

source: It is important both files are located in the same directory. Otherwise the process won't work.
de_de: Es ist wichtig, dass beide Dateien sich im selben Verzeichnis befinden. Andernfalls funktioniert der Prozess nicht.

source: Connect the router with your computer. In case it has multiple ports, use the yellow LAN-ports.
de_de: Verbinde den Router mit deinem Computer. Sollte dein Router mehrere Ports haben, benutze die gelben LAN-Ports.

source: Execute the flash-script by double-clicking on ``fritzflash.py``.
de_de: Führe das Flash-Skript mit einem doppelklick auf ``fritzflash.py`` aus.

source: In case Windows Firewall asks you whether you want to allow or deny network activity, select ``Allow``.
de_de: Falls die Windows Firewall nachfragt, ob Netzwerkaktivität Zugelassen oder Nicht zugelassen werden soll, wähle ``Zugriff zulassen`` aus.

source: In case you missed the 10 second window after powering on your AVM device power cycle it again.
de_de: Falls du das 10 Sekunden Zeitfenster nach dem Start verpasst hast starte das AVM Gerät jetzt nocheinmal neu."

source: Revert network settings
de_de: Wiederherstellen der Netzwerkeinstellungen

source: Before you are able to reach the Config-mode of your new node you have to reconfigure your network interface to automatically obtain an IP-address using DHCP.
de_de: Bevor du den Konfigurationsmodus deines neuen Freifunk-Knotens erreichen kannst, musst du die Netzwerkeinstellungen wieder zurückstellen, damit du mittels DHCP automatisch eine IP-Adresse bekommst.

source: Configure your network interface interface as pictured on the screenshot below and confirm by selecting ``OK`` in both windows.
de_de: Stelle dein Netzwerk wie im folgenden Screenshot erkennbar ein und bestätige beide Fenster mit Klick auf ``OK``.

source: Also remember to turn on your WiFi again.
de_de: Denke auch daran, dein WLAN wieder einzuschalten.
